<template>
  <div class="box">
      <h1>Тестовое задание SquareGPS</h1>
      <p>Необходимо с помощью <b>Vuejs, Vuex, VueRouter, Vuetify</b> приложение.<br>Хэдер приложения должен содержать меню из 2-х пунктов: <b>О задании</b> и <b>Карта</b>.<br>В основной части приложения должно отображаться содержимое разделов.</p>
      <h2>Раздел &#8220;О задании&#8220;</h2>
      <p>В разделе должен быть текст этого задания, сверстанный аналогично.</p>
      <h2>Раздел &#8220;Карта&#8220;</h2>
      <p>На экране должны быть карта и список (см пример):
        <ul>
          <li>При клике на кнопку добавления, карта должна перейти в режим добавления маркера: в месте клика должен появится маркер, а в списке - запись с координатами</li>
          <li>При клике на маркер должна подсвечиваться запись в списке</li>
          <li>При клике на запись в списке карта должна центрироваться на маркере</li>
          <li>Маркеры должны храниться локально и не пропадать после перезагрузки страницы</li>
          <li>В адресной строке должен отображаться id выбранного маркера</li>
        </ul>
      </p>
      <p><b>Дополнительно:</b>
        <ul>
          <li>Продумать отображение на мобильных устройствах</li>
          <li>Предусмотреть локализацию</li>
          <li>Необходимо с помощью <b>jest</b> написать 1 модульный тест на любой компонент</li>
          <li>Произвести имитацию сохранения данных на бекенд (асинхронно)</li>
        </ul>
      </p>
      <p><b>Напоминание:</b> тестовое задание призвано показать умение писать хороший модульный код, а также умение пользоваться указанными технологиями и не только.<br>Этим кодом нужно гордиться.</p>
      <p class="example">Пример:</p>
      <img src="./img.png" alt="map" class="image" width="600px" height="500px">
  </div>
</template>

<script>
export default {

}
</script>

<style>
p, h1, h2 {
  text-align: left;
}
ul {
  list-style-type: decimal;
}
ul li {
  margin-left: -15px;
}
.box {
  margin-left: 100px;
  margin-right: 100px;
}
.image {
  display: block;
  margin-left: 50px;
}
@media screen and (max-width: 800px) {
  .image {
      margin-left: -10px;
  }
  .box {
    margin-left: 10px;
    margin-right: 10px;
  }
}
@media screen and (max-width: 620px) {
  .image {
    display: none;
  }
  .example {
    display: none;
  }
}
</style>
